app/Controllers/CatalogoAccesorios.php

    public function index()
    {
        $accesoriosModel = new AccesoriosModel();
        $data['accesorios'] = $accesoriosModel->findAll();  // Obtén todos los accesorios
---
SELECT *
FROM `accesorios`