app/Controllers/ClientesController.php

    public function index()
    {
        $model = new ClientesModel();
        $searchQuery = $this->request->getGet('search');

        if (!empty($searchQuery)) {
            $data['clientes'] = $model->like('nombre', $searchQuery)
                                      ->orLike('cliente_id', $searchQuery)
                                      ->paginate(5);
        } else {
            $data['clientes'] = $model->paginate(5);
---
SELECT *
FROM `clientes`