app/Controllers/DetalleVentasController.php

SELECT *
FROM `detalle_ventas`
---
    public function index()
    {
        $model = new DetalleVentasModel();
        $data['detalle_ventas'] = $model->findAll();