app/Controllers/LoginController.php

SELECT *
FROM `usuarios`
WHERE `nombre_usuario` = 'clopez'
---
    public function login()
    {
        // Obtener las credenciales del formulario
        $nombre_usuario = $this->request->getPost('nombre_usuario');
        $contraseña = $this->request->getPost('contraseña');

        // Validar si los campos están vacíos
        if (empty($nombre_usuario) || empty($contraseña)) {
            return redirect()->to('/')->with('error', 'Por favor ingrese usuario y contraseña');
        }

        // Conexión a la base de datos
        $db = \Config\Database::connect();
        $builder = $db->table('usuarios');

        // Consultar si el nombre de usuario existe en la base de datos
        $user = $builder->where('nombre_usuario', $nombre_usuario)->get()->getRowArray();