app/Controllers/ProveedoresController.php

SELECT *
FROM `proveedores`
---
    public function index()
    {
        $model = new ProveedoresModel();
        $data['proveedores'] = $model->findAll();