app/Controllers/UsuariosController.php

    public function index()
    {
        $model = new UsuariosModel();
        $searchQuery = $this->request->getGet('search');

        if (!empty($searchQuery)) {
            $data['usuarios'] = $model->like('nombre_usuario', $searchQuery)
                                      ->orLike('usuario_id', $searchQuery)
                                      ->paginate(5);
        } else {
            $data['usuarios'] = $model->paginate(5);
---
SELECT *
FROM `usuarios`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `usuarios`

    public function store()
    {
        $nombre_usuario = $this->request->getPost('nombre_usuario');
        $contraseña = $this->request->getPost('contraseña');

        $hashed_password = password_hash($contraseña, PASSWORD_DEFAULT);

        $data = [
            'nombre_usuario' => $nombre_usuario,
            'contraseña' => $hashed_password
        ];

        $usuarioModel = new UsuariosModel();
        $usuarioModel->insert($data);
---
INSERT INTO `usuarios` (`nombre_usuario`, `contraseña`) VALUES ('jchinchilla', '$2y$10$yTBY.CculdpmmyWNWZZMKu05Y.Asfqs5h0N4ZS4IbRxA2Mis7TchO')