app/Controllers/VentasController.php

SELECT *
FROM `ventas`
---
    public function index()
    {
        $model = new VentasModel();
        $searchQuery = $this->request->getGet('search');

        if (!empty($searchQuery)) {
            $data['ventas'] = $model->like('fecha_ventas', $searchQuery)
                                      ->orLike('venta_id', $searchQuery)
                                      ->paginate(5);
        } else {
            $data['ventas'] = $model->paginate(5);