app/Controllers/VideojuegosController.php

    public function index()
    {
        $model = new VideojuegosModel();
        $searchQuery = $this->request->getGet('search');

        if (!empty($searchQuery)) {
            $data['videojuegos'] = $model->like('titulo', $searchQuery)
                                     ->orLike('plataforma', $searchQuery)
                                     ->orLike('genero', $searchQuery)
                                      ->orLike('videojuego_id', $searchQuery)
                                      ->paginate(5);
        } else {
            $data['videojuegos'] = $model->paginate(5);
---
SELECT *
FROM `videojuegos`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `videojuegos`